import { defineConfig } from "vitepress";
import { usePosts } from "./theme/utils/permalink";
// @ts-ignore
import markdownItTaskCheckbox from "markdown-it-task-checkbox";
import {
  groupIconMdPlugin,
  groupIconVitePlugin,
  localIconLoader,
} from "vitepress-plugin-group-icons";
import { MermaidMarkdown, MermaidPlugin } from "vitepress-plugin-mermaid";
import { link } from "fs";
import { text } from "stream/consumers";

const { rewrites } = await usePosts();

//导航栏
const nav = [
  { text: "首页", link: "/" },
  { text: "码农之路", link: "/programming/" },
  { text: "投资之路", link: "https://ai.feishu.cn/wiki/XWRawBlOiigL0Mk5RpycDN2LnXe" },
];

// 侧边栏
const sidebar = {
  programming: {
    items: [
      //   {
      //     text: "前言",
      //     link: "/programming/",
      //   },
      {
        text: "Mac 搭建开发环境",
        base: "/programming/build-env/",
        collapsed: true,
        items: [
          {
            text: "让终端更好用",
            link: "/terminal/",
          },
          {
            text: "Alfred",
            link: "/alfred/",
          },
          {
            text: "SSH & Git",
            link: "/ssh-git/",
          },
          {
            text: "搭建 Java 开发环境",
            link: "/java/",
          },
          {
            text: "搭建 Node 开发环境",
            link: "/node/",
          },
          {
            text: "搭建 Python 开发环境",
            link: "/python/",
          },
          {
            text: "搭建 Go 开发环境",
            link: "/go/",
          },
          {
            text: "安装 Docker & Kubernetes",
            link: "/docker-k8s/",
          },
          //   {
          //     text: "Chrome",
          //     link: "/chrome/",
          //   },
          {
            text: "👍 工具推荐",
            link: "/good-tools/",
          },
          {
            text: "JetBrains 插件推荐",
            link: "/jetbrains-plugins/",
          },
          {
            text: "Vscode 插件推荐",
            link: "/vscode-plugins/",
          },
        ],
      },
      // {
      //   text: "数据结构",
      //   base: "/programming/data-structure/",
      //   collapsed: true,
      //   items: [
      //     //   {
      //     //     text: "动态数组",
      //     //     link: "/array-list/",
      //     //   },
      //     //   {
      //     //     text: "链表",
      //     //     link: "/linked-list/",
      //     //   },
      //     //   {
      //     //     text: "栈",
      //     //     link: "/stack/",
      //     //   },
      //     {
      //       text: "树",
      //       collapsed: true,
      //       items: [
      //         {
      //           text: "前言",
      //           link: "/tree/",
      //         },
      //         //   {
      //         //     text: "二叉树",
      //         //     link: "/tree/binary",
      //         //   },
      //       ],
      //     },
      //     //   {
      //     //     text: "Map",
      //     //     link: "/map/",
      //     //   },
      //     {
      //       text: "堆",
      //       link: "/heap/",
      //     },
      //     //   {
      //     //     text: "并查集",
      //     //     link: "/union-find/",
      //     //   },
      //     //   {
      //     //     text: "图",
      //     //     link: "/graph/",
      //     //   },
      //     {
      //       text: "布隆过滤器",
      //       link: "/bloom-filter/",
      //     },
      //     //   {
      //     //     text: "跳表",
      //     //     link: "/skip-list/",
      //     //   },
      //   ],
      // },
      // {
      //   text: "算法",
      //   collapsed: true,
      //   base: "/programming/algorithm/",
      //   items: [
      //     {
      //       text: "前言",
      //       link: "/",
      //     },
      //     {
      //       text: "递归",
      //       link: "/recursion/",
      //     },
      //     {
      //       text: "算法策略",
      //       collapsed: true,
      //       items: [
      //         {
      //           text: "前言",
      //           link: "/strategy/",
      //         },
      //         {
      //           text: "回溯",
      //           link: "/strategy/backtracking/",
      //         },
      //         {
      //           text: "贪心",
      //           link: "/strategy/greedy/",
      //         },
      //         {
      //           text: "分治",
      //           link: "/strategy/divide-conquer/",
      //         },
      //         {
      //           text: "动态规划",
      //           link: "/strategy/dynamic-programming/",
      //         },
      //       ],
      //     },
      //     {
      //       text: "排序",
      //       collapsed: true,
      //       items: [
      //         {
      //           text: "前言",
      //           link: "/sort/",
      //         },
      //         {
      //           text: "冒泡排序",
      //           link: "/sort/bubble/",
      //         },
      //         {
      //           text: "选择排序",
      //           link: "/sort/selection/",
      //         },
      //         {
      //           text: "堆排序",
      //           link: "/sort/heap/",
      //         },
      //         {
      //           text: "插入排序",
      //           link: "/sort/insertion/",
      //         },
      //         {
      //           text: "归并排序",
      //           link: "/sort/merge/",
      //         },
      //         {
      //           text: "快速排序",
      //           link: "/sort/quick/",
      //         },
      //         {
      //           text: "希尔排序",
      //           link: "/sort/shell/",
      //         },
      //         {
      //           text: "计数排序",
      //           link: "/sort/counting/",
      //         },
      //         {
      //           text: "基数排序",
      //           link: "/sort/radix/",
      //         },
      //         {
      //           text: "桶排序",
      //           link: "/sort/bucket/",
      //         },
      //       ],
      //     },
      //     //   {
      //     //     text: "字符串匹配",
      //     //     link: "/string/",
      //     //   },
      //   ],
      // },
      // {
      //   text: "协议",
      //   base: "/programming/protocol/",
      //   collapsed: true,
      //   items: [
      //     //   {
      //     //     text: "HTTP",
      //     //     link: "/http/",
      //     //   },
      //     {
      //       text: "WebSocket 入门",
      //       link: "/websocket/basic/",
      //     },
      //   ],
      // },
      {
        text: "大模型工程",
        base: "/programming/llm/",
        collapsed: false,
        items: [
          {
            text: "开源 LLM 平台对比",
            link: "/platform/",
          },
          {
            text: "Java LLM 开源框架",
            link: "/kuajia/",
          },
          {
            text: "大模型 API 限流熔断方案",
            link: "/model4/",
          },
          {
            text: "轻量级 Web 服务部署",
            link: "/web1/",
          },
          {
            text: "大模型关键参数",
            link: "/web/",
          },
          {
            text: "SGLang 与 vLLM 对比分析",
            link: "/vllm/",
          },
          {
            text: "vLLM 对 PyTorch 的改写",
            link: "/pyTorch/",
          },
          {
            text: "模型训练 GPU 选择",
            link: "/gpu/",
          },
          {
            text: "TensorFlow Serving的优化方案",
            link: "/tfserving/",
          },
          {
            text: "文本分类 Agent 优化",
            link: "/text/",
          },
          {
            text: "特征查询中心",
            link: "/invoker/",
          },
          {
            text: "Flux vs Mono",
            link: "/flux/",
          },
          {
            text: "Streamable HTTP",
            link: "/httpstream/",
          },
          {
            text: "虚拟线程 vs 响应式编程",
            link: "/java21/",
          },
          {
            text: "MLOps vs LLMOps",
            link: "/mlops/",
          }

        ],
      },
      {
        text: "RAG & MCP & 微调",
        base: "/programming/rag/",
        collapsed: false,
        items: [

          {
            text: "RAG 系统优化指南",
            link: "/rag/",
          },
          {
            text: "RAG 多层缓存",
            link: "/rag7/",
          },
          {
            text: "RAG 自动迭代方案",
            link: "/auto/",
          },
          {
            text: "GraphRAG",
            link: "/graph/",
          },
          {
            text: "向量数据库选型",
            link: "/rag5/",
          },
          {
            text: "大模型如何微调",
            link: "/model2/",
          },
          {
            text: "LoRA 微调关键参数和指标",
            link: "/model3/",
          },
          {
            text: "MCP 技术原理",
            link: "/mcp/",
          },
          {
            text: "MCP Server 缓存设计方案",
            link: "/mcp1/",
          },
          {
            text: "instruction prompt 自动优化",
            link: "/p1/",
          },
          {
            text: "多轮对话 LLM 上下文超限优化",
            link: "/history/",
          },
        ],
      },
      {
        text: "Ai Coding",
        base: "/programming/aicoding/",
        collapsed: false,
        items: [
          {
            text: "传统编程 vs Vibe Coding",
            link: "/1/",
          },
          {
            text: "Spec Coding",
            link: "/2/",
          }
        ],
      },
      {
        text: "Dify",
        base: "/programming/dify/",
        collapsed: false,
        items: [
          {
            text: "Dify 部署开发",
            link: "/rag4/",
          },
          {
            text: "Dify API 网关核心架构",
            link: "/rag3/",
          },
          {
            text: "Dify 工作流引擎",
            link: "/workflow/",
          },
          {
            text: "Dify 知识库劣势",
            link: "/rag2/",
          },
          {
            text: "Dify 中 Go 应用模块",
            link: "/d1/",
          },
          {
            text: "Dify 的日志问题",
            link: "/log/",
          },
        ],
      },
      {
        text: "LangChain",
        base: "/programming/langChain/",
        collapsed: false,
        items: [
          {
            text: "LangGraph 核心特性",
            link: "/graph1/",
          },
          {
            text: "LangGraph 在 LangChain 之上提供了什么能力",
            link: "/langGraph/",
          },
          {
            text: "LangGraph 接入 MCP",
            link: "/mcp/",
          },
          {
            text: "Langfuse",
            link: "/langFuse/",
          },

        ],
      },
      {
        text: "风控安全",
        base: "/programming/risk/",
        collapsed: false,
        items: [
          {
            text: "知识图谱",
            link: "/tupu/",
          },{
            text:"NGAC",
            link: "tupu1"
          },{
            text:"基于图数据库实现 NGAC",
            link: "tupu2"
          },{
            text:"OPA 实现 ABAC 权限模型",
            link: "tupu3"
          },{
            text:"策略决策引擎之 OPA 与 Drools",
            link: "tupu4"
          },{
            text:"智能风控架构分享",
            link: "tupu5"
          },{
            text:"知识图谱：认知智能理论与实战",
            link: "tupu6"
          },{
            text:"安全知识图谱",
            link: "tupu7"
          },{
            text:"RSA+AES 混合加密",
            link: "rsa"
          },{
            text:"字段加密支持搜索技术方案",
            link: "rsa2"
          }
        ],
      },
      {
        text: "数据库",
        base: "/programming/db/",
        collapsed: false,
        items: [
          {
            text: "Kafka",
            link: "/kafka/",
          },
          {
            text: "RocketMQ",
            link: "/rocketmq/",
          },
          {
            text: "Redis",
            link: "/redis/",
          },
          {
            text: "MySQL",
            link: "/mysql/",
          },
          {
            text: "ES",
            link: "/es/",
          },
        ],
      },
      {
        text: "分布式",
        base: "/programming/distributed/",
        collapsed: false,
        items: [
            {
              text: "Sentinel",
              link: "/sentinel/",
            },
          {
            text: "分布式调度系统",
            link: "/schedule/",
          },
          {
            text: "分布式事务",
            link: "/transaction/",
          },
          {
            text: "Seata",
            link: "/seata/",
          },
        ],
      },
      {
        text: "Java",
        base: "/programming/java/",
        collapsed: false,
        items: [
          {
            text: "Spring",
            link: "/spring/",
          },{
            text: "并发",
            link: "/JUC/",
          },{
            text: "线程池",
            link: "/threadpool/",
          },{
            text: "JVM",
            link: "/jvm/",
          },
          {
            text: "GC 垃圾回收",
            link: "/gc/",
          },
          {
            text: "编译 JDK",
            link: "/source-code/",
          },
          {
            text: "Netty 入门",
            link: "/netty/",
          }
        ],
      },
      {
        text: "围炉夜话",
        base: "/programming/manage/",
        collapsed: false,
        items: [
          {
            text: "技术人成长路线",
            link: "/suibi2/",
          },
          {
            text: "Tech Lead",
            link: "/techLead/",
          },
          {
            text: "一点感想",
            link: "/suibi1/",
          },
          {
            text: "职场好习惯",
            link: "/suibi3/",
          },
          {
            text: "读书笔记之《黑客与画家》",
            link: "/book1/",
          },
        ],
      },
      // {
      //   text: "面试",
      //   base: "/programming/interview/",
      //   items: [
      //     {
      //       text: "Java",
      //       link: "/java",
      //     },
      //     {
      //       text: "spring",
      //       link: "/spring",
      //     },
      //     {
      //       text: "mysql",
      //       link: "/mysql",
      //     },
      //     {
      //       text: "redis",
      //       link: "/redis",
      //     },
      //     {
      //       text: "kafka",
      //       link: "/kafka",
      //     },
      //     {
      //       text: "elasticsearch",
      //       link: "/es",
      //     },
      //     {
      //       text: "架构和场景设计",
      //       link: "/design",
      //     },
      //     {
      //       text: "线上问题排查",
      //       link: "/problem",
      //     },
      //   ],
      // },
      //   {
      //     text: "中间件",
      //     base: "/programming/middleware/",
      //     collapsed: true,
      //     items: [],
      //   },
      //   {
      //     text: "Docker & Kubernetes",
      //     base: "/programming/docker-k8s/",
      //     collapsed: true,
      //     items: [],
      //   },
    ],
  },
};

export default defineConfig({
  title: "Cjx's Blog",
  base: "/",
  rewrites,

  head: [
    ["link", { rel: "icon", href: "/favicon.ico" }],
    [
      "meta",
      { name: "algolia-site-verification", content: "A2530A96135E8F25" },
    ],
  ],

  //关闭深色切换
  appearance: false,

  //markdown配置
  markdown: {
    //行号显示
    lineNumbers: true,

    // toc显示一级标题
    toc: { level: [1, 2, 3] },

    // 使用 `!!code` 防止转换
    codeTransformers: [
      {
        postprocess(code) {
          return code.replace(/\[\!\!code/g, "[!code");
        },
      },
    ],

    // 开启图片懒加载
    image: {
      lazyLoading: true,
    },

    config: (md) => {
      // 组件插入h1标题下
      (md.renderer.rules.heading_close = (tokens, idx, options, env, slf) => {
        let htmlResult = slf.renderToken(tokens, idx, options);
        if (tokens[idx].tag === "h1") htmlResult += `<ArticleMetadata />`;
        return htmlResult;
      }),
        // 代码组中添加图片
        md.use((md) => {
          const defaultRender = md.render;
          md.render = (...args) => {
            const [content, env] = args;
            const currentLang = env?.localeIndex || "root";
            const isHomePage =
              env?.path === "/" || env?.relativePath === "index.md"; // 判断是否是首页

            if (isHomePage) {
              return defaultRender.apply(md, args); // 如果是首页，直接渲染内容
            }
            // 调用原始渲染
            let defaultContent = defaultRender.apply(md, args);
            // 替换内容
            if (currentLang === "root") {
              defaultContent = defaultContent
                .replace(/NOTE/g, "提醒")
                .replace(/TIP/g, "建议")
                .replace(/IMPORTANT/g, "重要")
                .replace(/WARNING/g, "警告")
                .replace(/CAUTION/g, "注意");
            } else if (currentLang === "ko") {
              // 韩文替换
              defaultContent = defaultContent
                .replace(/NOTE/g, "알림")
                .replace(/TIP/g, "팁")
                .replace(/IMPORTANT/g, "중요")
                .replace(/WARNING/g, "경고")
                .replace(/CAUTION/g, "주의");
            }
            // 返回渲染的内容
            return defaultContent;
          };

          // 获取原始的 fence 渲染规则
          const defaultFence =
            md.renderer.rules.fence?.bind(md.renderer.rules) ??
            ((...args) => args[0][args[1]].content);

          // 重写 fence 渲染规则
          md.renderer.rules.fence = (tokens, idx, options, env, self) => {
            const token = tokens[idx];
            const info = token.info.trim();

            // 判断是否为 md:img 类型的代码块
            if (info.includes("md:img")) {
              // 只渲染图片，不再渲染为代码块
              return `<div class="rendered-md">${md.render(
                token.content
              )}</div>`;
            }

            // 其他代码块按默认规则渲染（如 java, js 等）
            return defaultFence(tokens, idx, options, env, self);
          };
        });

      md.use(groupIconMdPlugin); //代码组图标
      md.use(markdownItTaskCheckbox); //todo
    },
  },

  vite: {
    plugins: [
      groupIconVitePlugin({
        customIcon: {
          ts: localIconLoader(import.meta.url, "../public/svg/typescript.svg"), //本地ts图标导入
          md: localIconLoader(import.meta.url, "../public/svg/md.svg"), //markdown图标
          css: localIconLoader(import.meta.url, "../public/svg/css.svg"), //css图标
          shell: localIconLoader(import.meta.url, "../public/svg/shell.svg"),
          docker: localIconLoader(import.meta.url, "../public/svg/docker.svg"),
          js: "logos:javascript",
          java: "logos:java",
          python: "logos:python",
          go: "logos:go",
        },
      }),
      [MermaidPlugin()],
    ] as any,
    optimizeDeps: {
      include: ["mermaid"],
    },
    ssr: {
      noExternal: ["mermaid"],
    },
  },

  //此配置不会立即生效，需git提交后爬取时间戳，没有安装git本地报错可以先注释
  lastUpdated: true,

  themeConfig: {
    //左上角logo
    // logo: "/logo.png",
    //siteTitle: false, //标题隐藏

    //设置站点标题 会覆盖title
    //siteTitle: 'Hello World',

    //编辑本页
    editLink: {
      // 改成自己的仓库
      pattern: "https://github.com/yolk23321/my-blog/edit/main/docs/:path",
      text: "在GitHub编辑本页",
    },

    //上次更新时间
    lastUpdated: {
      text: "上次更新时间",
      formatOptions: {
        dateStyle: "short", // 可选值full、long、medium、short
        timeStyle: "medium", // 可选值full、long、medium、short
      },
    },

    //导航栏
    nav,

    //侧边栏
    sidebar,

    //Algolia 搜索
    search: {
      provider: "algolia",
      options: {
        appId: "4WG0I5MRK9",
        apiKey: "20a6ae93a1145cede55dfdd3c910cbe2",
        indexName: "blog-crawler",
        locales: {
          root: {
            placeholder: "搜索文档",
            translations: {
              button: {
                buttonText: "搜索文档",
                buttonAriaLabel: "搜索文档",
              },
              modal: {
                startScreen: {
                  recentSearchesTitle: "搜索历史",
                  noRecentSearchesText: "没有搜索历史",
                  saveRecentSearchButtonTitle: "保存至搜索历史",
                  removeRecentSearchButtonTitle: "从搜索历史中移除",
                  favoriteSearchesTitle: "收藏",
                  removeFavoriteSearchButtonTitle: "从收藏中移除",
                },
                errorScreen: {
                  titleText: "无法获取结果",
                  helpText: "你可能需要检查你的网络连接",
                },
                footer: {
                  selectText: "选择",
                  navigateText: "切换",
                  closeText: "关闭",
                },
                noResultsScreen: {
                  noResultsText: "无法找到相关结果",
                  suggestedQueryText: "你可以尝试查询",
                  reportMissingResultsText: "你认为该查询应该有结果？",
                  reportMissingResultsLinkText: "点击反馈",
                },
              },
            },
          },
        },
      },
    },

    //社交链接
    socialLinks: [
      // {
      //   icon: {
      //     svg: '<svg t="1759137908283" class="icon" viewBox="0 0 1049 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3866" width="200" height="200"><path d="M524.979332 0C234.676191 0 0 234.676191 0 524.979332c0 232.068678 150.366597 428.501342 358.967656 498.035028 26.075132 5.215026 35.636014-11.299224 35.636014-25.205961 0-12.168395-0.869171-53.888607-0.869171-97.347161-146.020741 31.290159-176.441729-62.580318-176.441729-62.580318-23.467619-60.841976-58.234462-76.487055-58.234463-76.487055-47.804409-32.15933 3.476684-32.15933 3.476685-32.15933 53.019436 3.476684 80.83291 53.888607 80.83291 53.888607 46.935238 79.963739 122.553122 57.365291 152.97411 43.458554 4.345855-33.897672 18.252593-57.365291 33.028501-70.402857-116.468925-12.168395-239.022047-57.365291-239.022047-259.012982 0-57.365291 20.860106-104.300529 53.888607-140.805715-5.215026-13.037566-23.467619-66.926173 5.215027-139.067372 0 0 44.327725-13.906737 144.282399 53.888607 41.720212-11.299224 86.917108-17.383422 131.244833-17.383422s89.524621 6.084198 131.244833 17.383422C756.178839 203.386032 800.506564 217.29277 800.506564 217.29277c28.682646 72.1412 10.430053 126.029806 5.215026 139.067372 33.897672 36.505185 53.888607 83.440424 53.888607 140.805715 0 201.64769-122.553122 245.975415-239.891218 259.012982 19.121764 16.514251 35.636014 47.804409 35.636015 97.347161 0 70.402857-0.869171 126.898978-0.869172 144.282399 0 13.906737 9.560882 30.420988 35.636015 25.205961 208.601059-69.533686 358.967656-265.96635 358.967655-498.035028C1049.958663 234.676191 814.413301 0 524.979332 0z" fill="#191717" p-id="3867"></path><path d="M199.040177 753.571326c-0.869171 2.607513-5.215026 3.476684-8.691711 1.738342s-6.084198-5.215026-4.345855-7.82254c0.869171-2.607513 5.215026-3.476684 8.691711-1.738342s5.215026 5.215026 4.345855 7.82254z m-6.953369-4.345856M219.900283 777.038945c-2.607513 2.607513-7.82254 0.869171-10.430053-2.607514-3.476684-3.476684-4.345855-8.691711-1.738342-11.299224 2.607513-2.607513 6.953369-0.869171 10.430053 2.607514 3.476684 4.345855 4.345855 9.560882 1.738342 11.299224z m-5.215026-5.215027M240.760389 807.459932c-3.476684 2.607513-8.691711 0-11.299224-4.345855-3.476684-4.345855-3.476684-10.430053 0-12.168395 3.476684-2.607513 8.691711 0 11.299224 4.345855 3.476684 4.345855 3.476684 9.560882 0 12.168395z m0 0M269.443034 837.011749c-2.607513 3.476684-8.691711 2.607513-13.906737-1.738342-4.345855-4.345855-6.084198-10.430053-2.607513-13.037566 2.607513-3.476684 8.691711-2.607513 13.906737 1.738342 4.345855 3.476684 5.215026 9.560882 2.607513 13.037566z m0 0M308.555733 853.526c-0.869171 4.345855-6.953369 6.084198-13.037566 4.345855-6.084198-1.738342-9.560882-6.953369-8.691711-10.430053 0.869171-4.345855 6.953369-6.084198 13.037566-4.345855 6.084198 1.738342 9.560882 6.084198 8.691711 10.430053z m0 0M351.145116 857.002684c0 4.345855-5.215026 7.82254-11.299224 7.82254-6.084198 0-11.299224-3.476684-11.299224-7.82254s5.215026-7.82254 11.299224-7.82254c6.084198 0 11.299224 3.476684 11.299224 7.82254z m0 0M391.126986 850.049315c0.869171 4.345855-3.476684 8.691711-9.560882 9.560882-6.084198 0.869171-11.299224-1.738342-12.168395-6.084197-0.869171-4.345855 3.476684-8.691711 9.560881-9.560882 6.084198-0.869171 11.299224 1.738342 12.168396 6.084197z m0 0" fill="#191717" p-id="3868"></path></svg>',
      //   },
      //   link: "https://github.com/cjxetf",
      // },
      {
        icon: {
          svg: '<svg t="1765358816296" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4670" width="200" height="200"><path d="M512 1024C229.2224 1024 0 794.7776 0 512 0 229.2224 229.2224 0 512 0c282.7776 0 512 229.2224 512 512 0 282.7776-229.2224 512-512 512z m17.066667-413.525333c34.850133 4.352 68.778667 5.12 102.741333 2.0992 23.04-2.048 44.817067-8.362667 64.170667-21.9136 38.212267-26.794667 49.783467-85.1968 24.251733-123.050667-14.626133-21.7088-36.8128-30.344533-60.757333-35.498667-35.054933-7.543467-70.4512-5.751467-105.847467-3.413333-5.666133 0.3584-6.7584 3.072-7.236267 8.209067-3.072 32.682667-6.536533 65.314133-9.813333 97.962666-2.5088 24.814933-4.932267 49.629867-7.509333 75.605334z m53.4016-33.928534c1.962667-20.906667 3.6352-39.338667 5.4272-57.770666 1.553067-15.906133 3.413333-31.778133 4.727466-47.701334 0.3584-4.283733 1.553067-6.656 5.956267-6.382933 15.616 1.041067 31.709867 0.034133 46.728533 3.652267 36.488533 8.823467 48.725333 54.306133 23.3472 83.029333-15.8208 17.902933-36.7616 23.586133-59.255466 25.088-8.465067 0.546133-17.015467 0.085333-26.9312 0.085333zM512 434.295467c-2.184533-0.648533-3.5328-1.1776-4.932267-1.4336-37.717333-6.877867-75.690667-8.328533-113.646933-2.816-20.974933 3.037867-41.0112 9.489067-57.480533 23.330133-22.9888 19.319467-21.640533 46.848 4.4032 62.0032 13.056 7.594667 28.023467 12.509867 42.5984 17.288533 14.08 4.608 28.996267 6.826667 43.144533 11.264 12.5952 3.925333 14.011733 14.318933 3.584 22.306134-3.345067 2.56-7.441067 5.085867-11.537067 5.751466-11.195733 1.826133-22.698667 4.386133-33.826133 3.566934-24.098133-1.774933-48.042667-5.461333-72.5504-8.430934-1.365333 10.615467-2.935467 23.0912-4.5568 35.9424 4.181333 1.365333 7.68 2.730667 11.264 3.618134 33.9456 8.4992 68.386133 9.608533 102.912 5.12 20.087467-2.6112 39.4752-7.901867 56.695467-19.029334 28.603733-18.4832 36.693333-57.1904-4.676267-75.383466-14.506667-6.382933-30.190933-10.410667-45.482667-15.086934-11.4176-3.4816-23.313067-5.614933-34.525866-9.5232-9.7792-3.413333-11.144533-12.202667-3.037867-18.397866 4.6592-3.549867 10.717867-6.997333 16.384-7.3728a480.853333 480.853333 0 0 1 53.384533-0.853334c15.377067 0.699733 30.651733 3.549867 46.4896 5.5296L512 434.295467z m257.143467 2.048L750.933333 614.2976h54.152534c4.778667-45.636267 9.710933-90.7264 14.062933-135.8848 0.6144-6.365867 2.3552-8.840533 8.686933-9.0112 11.434667-0.273067 22.8864-1.979733 34.286934-1.570133 23.722667 0.853333 42.3936 9.728 38.4 43.264-2.901333 24.2688-5.597867 48.571733-8.2432 72.874666-1.092267 10.069333-1.826133 20.189867-2.730667 30.4128h55.330133c3.584-35.259733 7.9872-70.058667 10.496-104.994133 3.413333-47.4624-17.7664-73.3184-64.682666-80.213333-40.96-6.007467-81.339733-0.341333-121.5488 7.133866z m-483.498667 134.6048c-8.738133 1.297067-16.384 2.798933-24.098133 3.4816-25.6512 2.235733-51.319467 3.9424-76.305067-4.266667-13.909333-4.590933-24.6784-12.578133-29.7984-25.9584-7.901867-20.701867 0.887467-47.104 19.831467-60.3136 17.373867-12.117333 37.717333-15.9232 58.453333-15.9232 22.545067-0.017067 45.090133 2.423467 68.232533 3.84L307.2 432.298667c-15.069867-1.723733-29.4912-3.925333-43.997867-4.9152-41.0112-2.798933-80.64 2.6112-117.469866 20.462933-30.020267 14.557867-52.053333 36.010667-58.6752 68.130133-7.850667 38.144 11.537067 69.495467 51.7632 85.845334 19.1488 7.765333 39.287467 12.509867 60.0064 12.5952 24.746667 0.1024 49.493333-1.570133 74.205866-2.952534 3.106133-0.170667 8.311467-2.901333 8.669867-5.034666 1.979733-11.554133 2.730667-23.278933 3.9424-35.464534z" fill="#DD1700" p-id="4671"></path></svg>'
        },
        link: "https://blog.csdn.net/qq798280904?type=blog",
      },
      // {
      //   icon: {
      //     svg: '<svg t="1759137824593" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3609" width="200" height="200"><path d="M726.51776 457.45152c-6.70208-0.0768-13.39392 0-20.00384-0.0768-2.37056 0-3.0464 1.05984-3.0464 3.23072 0.0768 5.10976 0.0768 10.13248 0.0768 15.232v0.01024c0.07168 4.87936 0 9.7536 0.07168 14.56128 0 3.90656 0.68096 4.66944 4.45952 4.66944 7.1424 0.0768 14.27456 0 21.41696 0.0768 2.67776 0 3.72736-1.28 3.65056-3.75808-0.08704-9.1648-0.08704-18.31936-0.15872-27.48416a6.7584 6.7584 0 0 0-6.46656-6.46144z" fill="#FF2E4D" p-id="3610"></path><path d="M849.92 51.2h-675.84c-67.8656 0-122.88 55.0144-122.88 122.88v675.84c0 67.8656 55.0144 122.88 122.88 122.88h675.84c67.8656 0 122.88-55.0144 122.88-122.88V174.08c0-67.8656-55.0144-122.88-122.88-122.88zM250.78784 505.73312c-0.73728 10.59328-1.41312 21.25312-2.60608 31.8464-2.08896 18.39104-6.24128 36.26496-14.6432 52.864-2.16064 4.12672-5.13536 7.79776-8.18176 12.45696-1.85344-3.90656-3.41504-6.97856-4.82816-10.13248a3203.59424 3203.59424 0 0 1-14.79168-33.56672c-0.52736-1.2032-0.896-2.92352-0.36864-3.97824 3.19488-6.83008 3.41504-14.12096 3.85536-21.40672 0.60416-9.15968 1.35168-18.24256 2.01728-27.39712 0.51712-7.00416 0.80896-13.9776 1.39776-20.96128 0.67584-8.10496 1.49504-16.21504 2.16064-24.24832 0.14848-1.96608 1.04448-2.56 2.82624-2.56 11.0848 0 22.07744 0 33.16224-0.07168 2.37056 0 3.0464 0.98304 2.89792 3.23072-0.96768 14.63296-1.86368 29.28128-2.89792 43.92448z m71.29088 87.32672c-0.73728 9.46176-5.13536 17.49504-12.5696 23.5008-5.43232 4.352-11.74528 6.15936-18.6624 6.08256-5.87264 0-11.66848-0.0768-17.54112 0-2.00192 0-3.27168-0.60416-4.09088-2.55488-3.41504-7.6544-6.90688-15.32416-10.32192-22.97344-0.52736-1.13152-0.67584-2.33472-1.13152-3.456-1.63328-4.12672-1.5616-4.28544 2.97472-4.36224h13.90592c5.94944 0 8.47872-2.46784 8.5504-8.56576 0.07168-4.57216 0.07168-9.14944 0.07168-13.73696V494.2336c0.14848 0.15872 0.22016 0.15872 0.29696 0.15872V408.63744c0-4.28544 0.14848-4.43392 4.38784-4.43392h29.21472c5.13536 0 5.20704 0.14848 5.20704 5.40672 0 27.1872 0 54.36416 0.0768 81.47968 0.0768 23.87456 0.29696 47.75936 0.29696 71.6288 0 10.14272 0.14848 20.26496-0.6656 30.34112z m75.58656-28.90752c-4.98688 11.56096-10.19904 22.97344-15.31904 34.4576-0.45568 1.13664-1.19296 2.25792-2.3808 4.42368v0.01024c-2.97472-4.5056-6.0928-8.18176-8.11008-12.39552-2.82624-6.13888-4.5312-12.83584-7.35744-18.9952-3.0464-6.6816-4.15744-13.88032-5.57568-20.94592-1.1776-6.02112-1.40288-12.25216-1.8432-18.3296-1.2032-15.39584-2.23744-30.78656-3.44064-46.09536a2449.95584 2449.95584 0 0 0-2.0736-25.1648c-0.14848-1.50016 0.2304-2.176 1.94048-2.176 11.52512 0 22.97344-0.14848 34.49856-0.22016 2.1504 0 3.0464 0.96768 3.11808 2.9952 0.29696 4.65408 0.51712 9.31328 0.88576 13.97248 0.29696 3.83488 0.73728 7.6544 1.04448 11.41248 0.51712 5.40672 1.04448 10.81344 1.41312 16.14336 0.51712 6.90688 0.51712 13.81888 1.4848 20.63872 1.34144 10.4448 0.29696 21.10464 3.93216 31.32928 0.89088 2.40128-0.96768 6.08768-2.21696 8.93952z m84.28032 22.016c-2.89792 6.6816-6.02112 13.21472-8.99072 19.82464-1.64352 3.74784-3.19488 7.49568-4.76672 11.25376-1.85344 4.51072-3.11808 5.40672-7.87456 5.40672h-22.2976c-7.52128 0-15.0272 0.23552-22.53312-0.0768-3.56352-0.14336-7.0656-1.27488-10.62912-2.02752-1.792-0.36864-2.16064-1.42336-1.41312-3.14368a3709.71648 3709.71648 0 0 0 13.45024-29.21472c1.04448-2.24768 1.85344-4.65408 3.0464-6.90688 0.29696-0.6144 1.41312-1.28 2.00192-1.13152 12.42112 3.15392 25.13408 2.77504 37.76512 2.63168a874.6496 874.6496 0 0 1 20.07552 0c3.19488 0.00512 3.50208 0.45568 2.16576 3.38432z m3.84-21.86752a4.48512 4.48512 0 0 1-2.74944 1.4336c-13.89568 0.0768-27.8784 0.14848-41.77408-0.0768-4.23936-0.08704-8.5504-1.05472-11.74528-4.28544-3.3536-3.3792-4.98688-7.36256-3.28192-11.93984a897.52576 897.52576 0 0 1 9.58464-24.10496c3.88096-9.15456 7.81312-18.31936 12.05248-28.2368-2.30912-0.14848-3.712-0.29696-5.04832-0.29696-4.09088-0.07168-8.18176 0.29696-12.27264-0.2304-4.45952-0.51712-8.99072-1.04448-12.48256-4.79232-3.42528-3.6864-3.94752-8.04352-2.60608-12.32384 2.1504-6.83008 4.97664-13.44 7.80288-20.04992 2.67776-6.15424 5.72416-12.16 8.47872-18.24256 2.97472-6.53824 5.86752-13.07136 8.77056-19.6096a1361.99168 1361.99168 0 0 0 7.6544-17.33632c0.73728-1.80736 1.8688-2.47808 3.87072-2.47808 10.93632 0.07168 21.92896 0 32.86528 0 3.6352 0 3.712 0.36864 2.29888 3.6864-6.31296 14.63296-12.71808 29.20448-18.95936 43.84768a11.52 11.52 0 0 0-1.19296 4.87936c0.22016 3.90656 1.04448 4.5056 5.06368 4.5056 8.17152 0.0768 16.35328 0 24.448 0 1.64864 0 3.3536 0.22016 4.98688 0.29696 2.30912 0.0768 2.60608 1.05984 1.63328 3.072a2455.21408 2455.21408 0 0 0-13.3888 29.21472c-3.03616 6.91712-5.93408 13.89568-8.9088 20.8128a1530.1632 1530.1632 0 0 1-6.1696 13.80864c-1.94048 4.20352-0.60416 6.31296 4.15232 6.38976 6.02112 0 12.04224 0.0768 18.05824 0 2.08896 0 3.13344 0.60416 2.08896 2.85184-3.6352 8.25344-7.21408 16.58368-10.84928 24.85248-0.67072 1.50016-1.408 3.072-2.3808 4.352z m134.81472 58.73664h-125.3376c-1.72032-0.22016-3.48672-0.22016-5.94432-0.22016v-0.01536c0.88064-2.61632 1.41312-4.41856 2.1504-6.0672 4.69504-10.29632 9.4464-20.5056 14.0544-30.79168 1.04448-2.33472 2.52928-2.92352 4.75648-2.92352h28.6976c4.54656 0 4.75648-0.2304 4.75648-4.74112V461.66016c0-3.97824-0.0768-4.05504-4.08064-4.05504-6.10304 0-12.26752-0.0768-18.36544 0-2.30912 0-3.27168-0.51712-3.27168-3.1488 0.14848-10.97216 0.0768-21.92896 0.0768-32.88576 0-3.90656 0.0768-3.90656 3.86048-3.90656h73.00096c4.23936 0 8.5504 0.0768 12.78976 0 2.01728 0 2.82624 0.82432 2.74944 2.85184-0.0768 11.41248-0.0768 22.82496-0.0768 34.31424 0 2.02752-0.73728 2.77504-2.82624 2.77504-6.6048-0.0768-13.14304 0.07168-19.77856 0.07168-2.29376 0-3.33824 1.05984-3.33824 3.46624 0.0768 18.39104 0.14336 36.7104 0.14336 55.11168 0 20.87424 0 41.74848 0.0768 62.6944 0 3.75808 0.36864 4.21376 4.17792 4.21376h31.4368c3.41504 0 3.87072 0.36864 3.93728 3.81952 0.08704 10.97216 0 21.92896 0.08704 32.89088-0.01024 2.8672-1.57184 3.16416-3.73248 3.16416z m198.69696-34.92864c-0.14848 16.37376-11.008 29.21472-26.38848 32.89088-4.31616 1.05472-8.78592 1.35168-13.24544 1.5104-6.83008 0.22016-13.7472 0.07168-20.58752 0.07168-4.23936 0-5.42208-0.83456-6.9888-4.66432-3.33824-7.95136-6.83008-15.90784-10.26048-23.87456l-0.66048-1.57184c-1.19296-3.072-0.81408-3.61472 2.45248-3.61472 9.43616-0.07168 18.95424 0.15872 28.3904-0.29184 5.65248-0.29696 8.03328-2.85696 8.18688-8.64256 0.22016-11.04384-0.29696-22.07744-0.14848-33.11104 0.0768-5.48864-6.84032-11.42272-11.74528-11.71968a32.8448 32.8448 0 0 0-2.74944-0.14336c-18.73408 0-37.54496 0-56.2688 0.07168-5.27872 0-5.65248 0.53248-5.65248 5.8624l0.20992 77.55776c0 4.14208-0.0768 4.21376-4.23936 4.21376h-31.22176c-4.01408 0-4.3008-0.3072-4.3008-4.28544v-39.94112c0.06144 0.14336 0.13312 0.14336 0.20992 0.14336v-40.99584c0-2.78016-1.85344-2.93888-3.78368-2.93888-10.19392 0.08704-20.44416 0.31232-30.62272 0.31232-6.92224 0-6.17984 0.8192-6.25664-6.38976-0.0768-9.90208 0-19.90144 0-29.80352 0-3.59936 0.36864-4.05504 3.94752-4.13184 10.7008-0.07168 21.33504 0 32.04096-0.07168 4.09088 0 4.31104-0.15872 4.38272-4.21376 0.0768-9.90208-0.0768-19.8144 0-29.73184 0-2.4832-1.04448-3.23072-3.41504-3.23072-6.84544 0.0768-13.76256-0.07168-20.60288 0-2.1504 0-2.89792-0.74752-2.89792-2.92352 0.09216-11.26912 0.09216-22.46144-0.06144-33.72544 0-2.70336 1.03424-3.29216 3.41504-3.29216 6.31296 0.0768 12.6464 0 18.95936 0 4.23424 0 4.45952-0.3072 4.5312-4.74112 0-2.61632 0.14848-5.24288 0-7.87456-0.07168-2.4832 1.04448-3.15904 3.34336-3.15904 9.07776 0.0768 18.22208 0.0768 27.28448 0.0768h4.97664c3.94752 0 4.0192 0 4.1728 4.05504 0.06656 2.4064-0.1536 4.87936-0.08704 7.28576 0.0768 3.3792 0.9728 4.2752 4.31616 4.36224 5.65248 0.0768 11.30496 0.0768 17.024 0.0768 14.6432 0.07168 27.3664 5.09952 37.0176 16.29184 5.35552 6.22592 8.69888 13.81888 9.216 22.14912 0.52736 8.47872 0.15872 17.03936 0.3072 25.52832 0 3.15904 0.22016 6.38976 0.36864 9.53344 0.14336 3.15904 0.896 3.97824 4.09088 3.90656a48.56832 48.56832 0 0 1 19.03104 3.15904c13.00992 5.03808 21.03296 14.18752 23.63904 28.01152a44.4416 44.4416 0 0 1 0.73728 8.33024c0.08192 17.88928 0.06656 35.78368-0.06656 53.6832zM810.14272 453.632c-5.94432 3.90656-12.1856 3.75808-19.4048 3.6864-2.23744 0-5.20192 0.07168-8.09984-0.0768-0.7424-0.07168-2.00704-0.98304-2.08896-1.5872-0.6656-8.84736-1.77152-17.792 1.35168-26.35264 2.75456-7.5776 9.58464-12.01664 17.61792-12.16a19.99872 19.99872 0 0 1 19.32288 14.336c2.30912 8.2688-1.55648 17.42336-8.69888 22.15424z" fill="#FF2E4D" p-id="3611"></path></svg>',
      //   },
      //   //link: "https://www.xiaohongshu.com/user/profile/5d3b00e9000000001200e8a7",
      // },
    ],

    //手机端深浅模式文字修改
    darkModeSwitchLabel: "深浅模式",

    //页脚
    footer: {
      message: "Released under the MIT License.",
      copyright: `Copyright © 2023-${new Date().getFullYear()} 备案号：<a href="https://beian.miit.gov.cn/" target="_blank">京****号</a>`,
    },
    //侧边栏文字更改(移动端)
    sidebarMenuLabel: "目录",

    //返回顶部文字修改(移动端)
    returnToTopLabel: "返回顶部",

    //大纲显示2-3级标题
    outline: {
      level: [2, 3],
      label: "当前页大纲",
    },

    //自定义上下页名
    docFooter: {
      prev: "上一页",
      next: "下一页",
    },
  },

  // 当设置为 true 时，VitePress 不会因为死链而导致构建失败。
  ignoreDeadLinks: true,
});
